#include<iostream>
#include<clocale>
#include<cmath>
using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	double a, b, c, D, x1, x2, x3, x4, z1, z2;
	cout << "Уравнение ax^4+bx^2+c=0 " << endl;
	cout << "Введите a: ";
	cin >> a;
	cout << "Введите b: ";
	cin >> b;
	cout << "Введите с: ";
	cin >> c;

	if (a != 0 && b != 0 && c != 0) { // Если все коэффиценты не равны 0 мы считаем дискриминант по обычной формуле
		D = (b * b) - 4 * a * c;
		if (D < 0) { // Если <0 то нет решения
			cout << "Нет решений " << endl;
		}
		else {
			if (D == 0) {// Если D=0 то считаем по формуле -b/2*a
				z1 = (-b / 2 * a); 
				if (z1 > 0) { //  Если корень уравнения at^2 + b^t+c=0 больше 0 то у нас два x  (t=x^2)
					x1 = pow(z1, 0.5);
					x2 = -pow(z1, 0.5);
					cout << "x1 = " << x1 << endl;
					cout << "x2 = " << x2 << endl;
				}
				else {
					if (z1 == 0) {  //  Если корень уравнения at^2 + b^t+c=0 равен 0 то x=0
						x1 = 0;
						cout << "x1 = " << x1 << endl;
					}
					else {
						cout << "Нет решения"; /*  Если корень уравнения at^2 + b^t+c=0 меньше 0 то в уравнении
											   ax^4+bx^2+c=0 нет корней*/
					}
				}
			}
			else {  // Если D>0 то считаем два корня уравнения at^2 + b^t+c=0
				z1 = ((-b + pow(D, 0.5)) / (2 * a)); 
				z2 = ((-b - pow(D, 0.5)) / (2 * a));
				if (z1 > 0 && z2 > 0) {/* Если два корня уравнения at^2 + b^t+c=0 больше 0 
										 то уравнение ax^4+bx^2+c=0 имеет четыре корня*/
					x1 = pow(z1, 1 / 2);
					x2 = -pow(z1, 1 / 2);
					x3 = pow(z2, 1 / 2);
					x4 = -pow(z2, 1 / 2);
					cout << "x1 = " << x1 << endl;
					cout << "x2 = " << x2 << endl;
					cout << "x3 = " << x3 << endl;
					cout << "x4 = " << x4 << endl;
				}
				else {
					if (z1 < 0 && z2 < 0) { /* Если оба корня уравнения at^2 + b^t+c=0 <0 то в уравенении  
											ax^4+bx^2+c=0 нет корней*/
						cout << "Нет решения" << endl;
					}
					else {
						if (z1 < 0) { // Если первый корень уравнения at^2 + b^t+c=0 меньше 0
							if (z2 != 0) { // и второй больше 0 то 2 корня
								x1 = pow(z2, 0.5);
								x2 = -pow(z2, 0.5);

								cout << "x1 = " << x1 << endl;
								cout << "x2 = " << x2 << endl;
							}
							else { // если второй корень равен 0 
								x1 = 0;
								cout << "x1 = " << x1 << endl;
							}
						}
						else {
							if (z2 < 0) {// Если второй корень уравнения at^2 + b^t+c=0 меньше 0
								if (z1 != 0) {// и второй больше 0 то 2 корня
									x1 = pow(z1, 0.5);
									x2 = -pow(z1, 0.5);
									cout << "x1 = " << x1 << endl;
									cout << "x2 = " << x2 << endl;
								}
								else {// если первый корень равен 0 
									x1 = 0;
									cout << "x1 = " << x1 << endl;
								}
							}

						}
					}
				}

			}
		}
	}
	else {
		if (a != 0 && b != 0) { // Если коэффицент с равен 0, но a и b не равны 0
			x1 = 0;  // точно один из корней 0
			cout << "x1 = " << x1 << endl;
			z1 = -b / a;
			if (z1 > 0) {//  Если корень уравнения at^2 + b^t=0 больше 0 то три корня
				x2 = pow(z1, 0.5);
				x3 = -pow(z1, 0.5);
				cout << "x2 = " << x1 << endl;
				cout << "x3 = " << x2 << endl;

			}

		}
		else {
			if (a != 0 && c != 0) {// Если коэффицент b равен 0, но a и c не равны 0
				z1 = -c / a;
				if (z1 > 0) {//Если корень уравнения at^2 +c=0 больше 0 то два корня
					x1 = pow(z1, 0.25);
					x2 = -pow(z1, 0.25);
					cout << "x1 = " << x1 << endl;
					cout << "x2 = " << x2 << endl;
				}
				else {
					cout << "Нет решения" << endl;
				}
			}
			else {
				if (b != 0 && c != 0) {// Если коэффицент a равен 0, но b и c не равны 0
					z1 = ((-c) / b);
					if (z1 > 0) {//Если корень уравнения bt+c=0 больше 0 то два корня
						x1 = pow(z1, 0.5);
						x2 = -pow(z1, 0.5);
						cout << "x1 = " << x1 << endl;
						cout << "x2 = " << x2 << endl;
					}
					else {
						cout << "Нет решения" << endl;
					}
				}
				else {
					if (b == 0&& a == 0 && c!=0) { // Если все коэффиценты кроме с равны 0 то нет решения 
						cout << "Нет решения" << endl;
					}
					
				}
			}
		}
	}
	if ((a == 0 && c == 0&& b!=0) || (b == 0 && c == 0&&a!=0)) { 
		x1 = 0;
		cout << "x1 = " << x1 << endl;
	}
	else {
		if (a == 0 && b == 0 && c == 0) {
			cout << "0=0" << endl;

		}
		
	}
	return 0;
}